[InteractiveObjects.Lobelia_TestingZone_GenericButton InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_TestingZoneOnion MissionItemDefinition]
UseFailureCharacterMessage="You must" %s This item."
ItemName="snow bow"
PickupMessage="near you %s"
UseFailureLevelMessage="You must be at least %d level to use this item."
UseFailureConstraintsMessage="You can't use it.."
NoManufacturerName="normal"

[ItemDefs.ID_TestingZoneOnion:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="It is fried and tastes great.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_TestingZoneOnionRepeat MissionItemDefinition]
UseFailureCharacterMessage="I have %s Use this number."
ItemName="Onion ice cream"
PickupMessage="think %s"
UseFailureLevelMessage="You must be at least %d level to use this item.."
UseFailureConstraintsMessage="You cannot use this item.."
NoManufacturerName="normal"

[ItemDefs.ID_TestingZoneOnionRepeat:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Delicious fries."
NoConstraintText=""
Suffix=""
Prefix=""

